Public Attributes | List of all members
API_RailingPostQuantity Struct Reference
Element Manager
Calculated values for the railing posts. More...
#include <APIdefs_Elements.h>
 Public Attributes
 double  | volume
Volume of the railing post.
 double  | length3D
Length of the 3D reference line of the railing post.
Detailed Description
Calculated values for the railing posts.